# Задача 1. 
#a = int(input("введите число"))
#b = int(input("введите число"))
#if a != b:
    #if a  > b:
        #print ("1 максимальное, 2 минимальное")
    #else: 
        #print ("1 минимальное, 2 максимальное")
        
# задача 2. 
#a = int(input("длина стороны квадрата"))
#b = int(input("радиус"))
#if b <= a / 2:
    #print("Круг впишеться")
#else:
    #print("Круг не впишеться")
    
#задача 3. 
#a = int(input("ввод a"))
#b = a**2
#if b < 0:
    #print("значение функции b меньше 0")
#else:
    #print("значение функции b не меньше 0")
    
# задача 4. 
#a = int(input("длинa стороны квадрата"))
#b = int(input("радиуса круга"))
#if a <= 2 * b:
    #print("Квадрат впишеться ")
#else:
    #print("Квадрат не впишеться")

#задача 5. 
#a = int(input("Введите первое число"))
#b = int(input("Введите второе число"))
#if a > b: 
    #print (a)
#else: 
    #print (b)