#Задание 6
a = float(input("введите 1 сторону"))
b = float(input("введите 2 сторону"))
c = (a**2 + b**2) ** 0.5
p = a + b + c
print(p)

#Задание 7 
a = float(input("Введите сторону квадрата"))
d = (a**2 + a**2) ** 0.5
p = a**3
print(d,p)

#Задание 8. 
a = float(input("Введите радиус большего круга"))
b = float(input("Введите радиус меньшего круга"))
s = (a ** 2 - b ** 2) * 3.14
print(s)

#Задание 9. 
a = float(input("Введите ребро куба"))
s = a**2
v = a**3
print(s,v)

#Задание 10. 
a = float(input("введите меньшее основание"))
b = float(input("введите большее основание"))
c = float(input("введите высоту"))
s = ((a + b) / 2) * c
print(s)